_posts/language/2016-08-18-english-invigorate.html
---
layout: post
title: 单词本：精神焕发
categories: [language]
tags: [English]
---

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 11 届 G20 峰会主题</h2>
<div class="outline-text-2" id="text-1">
<p>
早上起来看新闻，中国日报新闻说习大大要参加主持在杭州举办的 11 届 G20 峰会。外交部发言人陆慷说：
</p>

<blockquote>
<p>
The theme of the 11th G20 summit will be "Toward an Innovative, <i>Invigorated</i>,
Interconnected and Inclusive World Economy".
</p>
</blockquote>

<p>
本届 G20 峰会主题为：构建创新、/活力/、联动、包容的世界经济。
</p>

<p>
因为第一次见到 invigorate 这个单词，所以本文重点对此展开学习学习。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> invigorate</h2>
<div class="outline-text-2" id="text-2">
<p>
to import vigor, strength, or vitality to, to give life or energy to 赋予精力、能量、活力、生命、能量。也写成 envigorate, invigourate。beleben<sup>(de)</sup>,
kräftigen<sup>(de)</sup>, stärken<sup>(de)</sup>；revigorer<sup>(fr)</sup>。
</p>
<ul class="org-ul">
<li>Exercise is <i>invigorating</i>. 运动带来活力。</li>
<li>they were <i>invigorated</i> by the chilly autumn air. 秋天的冷空气使他们神清气爽。</li>
<li>The cold water <i>invigorated</i> him. 冰水给他能量。 L‘eau froide s'a revigoré。</li>
<li>China aims to <i>invigorate</i> EU ties.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> 中国要激活与英国的联系。to
invigorate ties, Beziehung beleben<sup>(de)</sup></li>
<li>Ce cordial m’a <i>revigoré</i>.<sup>(fr)</sup> 此甜酒赋予我活力。</li>
<li>Cette bonne nouvelle l’a tout <i>revigoré</i>.<sup>(fr)</sup> 这本新小说赋予他活力。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> vigor/vigour</h2>
<div class="outline-text-2" id="text-3">
<p>
力量，健康，活力。die Vitalität<sup>(de)</sup>, die Kraft<sup>(de)</sup>. la vigueur<sup>(fr)</sup>.
</p>

<ul class="org-ul">
<li>Do you have a <i>vigor</i>? A <i>vigor</i> for rigor?<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></li>
<li>Before long, you’ll be jumping out of bed with more <i>vigor</i> than ever because
you know people are relying on you.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> 曾几何时，你从床上跃起，充满能量，因为你知道有人需要你。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> reinvigorate</h2>
<div class="outline-text-2" id="text-4">
<p>
使再振作，使复兴。
</p>

<ul class="org-ul">
<li>How can Kenya <i>reinvigorate</i> manufacturing?<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> 肯尼亚如何振兴制造业？</li>
<li>The fresh figures are bad news Prime Minister Shinzo Abe, whose government has
been struggling to <i>reinvigorate</i> the faltering domestic economy.<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> 最近的日本财政数字不佳，安倍晋三政府在努力振兴经济。</li>
<li>The modern, high-quality space that has been created is set to <i>reinvigorate</i>
the working environment for employees and provides a clean, modern
infrastructure complete with the latest technology.<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> 总结</h2>
<div class="outline-text-2" id="text-5">
<p>
本文首先学习了 G20 峰会的主题词“Toward an Innovative, <i>Invigorated</i>,
Interconnected and Inclusive World Economy”，然后学习了其中的单词 invigorate，并挖掘出它的词根 vigor，以及衍生词 reinvigorate。
</p>

<p>
无知的好处是随时随地都有机会学习新东西，可以学习新东西是多么幸福的事情呀。这可以算是傻人有傻福的一种新解释吧。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://english.gov.cn/state_council/2015/03/16/content_281475072547652.htm">http://english.gov.cn/state_council/2015/03/16/content_281475072547652.htm</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="http://ask.metafilter.com/299046/Do-you-have-a-vigor-A-vigor-for-rigor">http://ask.metafilter.com/299046/Do-you-have-a-vigor-A-vigor-for-rigor</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://incomeclub.co/avoid-non-financial-problems-new-retiree/">https://incomeclub.co/avoid-non-financial-problems-new-retiree/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="http://africanbusinessmagazine.com/sectors/infrastructure/can-kenya-reinvigorate-manufacturing/">http://africanbusinessmagazine.com/sectors/infrastructure/can-kenya-reinvigorate-manufacturing/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="http://myhealthbowl.com/2016/08/18/japans-trade-shrinks-in-july-exports-sink-14-percent.html">http://myhealthbowl.com/2016/08/18/japans-trade-shrinks-in-july-exports-sink-14-percent.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.travelmole.com/news_feature.php?news_id=2023352">http://www.travelmole.com/news_feature.php?news_id=2023352</a>
</p></div></div>


</div>
</div>
